Repository: kirill-jjj/teamtalk_reg_system
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: native_language_name
ru: Русский

source: TeamTalk Registration
ru: Регистрация в TeamTalk

source: Select Language:
ru: Выберите язык:

source: Language:
ru: Язык:

source: Set Language
ru: Установить язык

source: If you want to register on the server
ru: Если вы хотите зарегистрироваться на сервере

source: please fill out the form below.
ru: пожалуйста, заполните форму ниже.

source: Username:
ru: Имя пользователя:

source: Nickname (optional):
ru: Никнейм (необязательно):

source: Defaults to username if blank
ru: По умолчанию будет использовано имя пользователя, если оставить поле пустым

source: Password:
ru: Пароль:

source: Show Password
ru: Показать пароль

source: Register
ru: Зарегистрироваться

source: You have <span id='countdown-timer'>10:00</span> to download your .tt file, client or use the quick connect link.
ru: У вас есть <span id="countdown-timer">10:00</span>, чтобы скачать ваш .tt файл, клиент или использовать ссылку для быстрого подключения.

source: Quick Connect Link:
ru: Ссылка для быстрого подключения:

source: Download .tt file
ru: Скачать .tt файл

source: Download pre-configured TeamTalk Client (ZIP)
ru: Скачать преднастроенный клиент TeamTalk (ZIP)

source: expired
ru: истекло

source: second
ru: секунда

source: seconds_few
ru: секунды

source: seconds
ru: секунд

source: Language set successfully.
ru: Язык успешно установлен.

source: You have already registered one TeamTalk account from this Telegram account. Only one registration is allowed.
ru: Вы уже зарегистрировали одну учетную запись TeamTalk с этого Telegram аккаунта. Разрешена только одна регистрация.

source: Hello! Please enter a username for registration.
ru: Здравствуйте! Пожалуйста, введите имя пользователя для регистрации.

source: this account
ru: этот аккаунт

source: Registration request not found or outdated.
ru: Запрос на регистрацию не найден или устарел.

source: This Telegram account has already a TeamTalk account linked.
ru: К этому Telegram-аккаунту уже привязана учетная запись TeamTalk.

source: User {} registration approved.
ru: Регистрация пользователя {} одобрена.

source: Your registration has been approved by the administrator. You can now use TeamTalk.
ru: Ваша регистрация была одобрена администратором. Теперь вы можете использовать TeamTalk.

source: User {} registration declined.
ru: Регистрация пользователя {} отклонена.

source: Your registration has been declined by the administrator.
ru: Ваша регистрация была отклонена администратором.

source: Please enter your desired nickname.
ru: Пожалуйста, введите желаемый никнейм.

source: Error: Username not found. Please start over.
ru: Ошибка: имя пользователя не найдено. Пожалуйста, начните сначала.

source: Invalid choice. Please try again.
ru: Неверный выбор. Пожалуйста, попробуйте снова.

source: Language updated successfully!
ru: Язык успешно обновлен!

source: Please choose your language:
ru: Пожалуйста, выберите ваш язык:

source: Sorry, language selection is currently unavailable.
ru: Извините, выбор языка в данный момент недоступен.

source: Sorry, this username is already taken. Please choose another username.
ru: Извините, это имя пользователя уже занято. Пожалуйста, выберите другое.

source: Now enter a password.
ru: Теперь введите пароль.

source: Registration error. Please try again later or contact an administrator.
ru: Ошибка регистрации. Пожалуйста, попробуйте позже или свяжитесь с администратором.

source: This Telegram account has already registered a TeamTalk account. Only one registration is allowed.
ru: С этого Telegram-аккаунта уже зарегистрирована учетная запись TeamTalk. Разрешена только одна регистрация.

source: TeamTalk Admin
ru: Администратор TeamTalk

source: TeamTalk User
ru: Пользователь TeamTalk

source: This TeamTalk account will be for username '{username}'. Do you want to register it as a TeamTalk 'Admin' or a regular 'User' on the server?
ru: Эта учетная запись TeamTalk будет для имени пользователя '{username}'. Вы хотите зарегистрировать её как 'Администратора' TeamTalk или как обычного 'Пользователя' на сервере?

source: Nickname cannot be empty. Please enter a valid nickname.
ru: Никнейм не может быть пустым. Пожалуйста, введите корректный никнейм.

source: Yes
ru: Да

source: No (use username)
ru: Нет (использовать имя пользователя)

source: Your username will be '{username}'. Would you like to set a different nickname? If not, your nickname will be the same as your username.
ru: Ваше имя пользователя будет '{username}'. Хотите установить другой никнейм? Если нет, ваш никнейм будет таким же, как имя пользователя.

source: Your .tt file for quick connection
ru: Ваш .tt файл для быстрого подключения

source: Or use this TT link:
ru: Или используйте эту TT ссылку:

source: Could not send the .tt file or link. Please contact an admin.
ru: Не удалось отправить .tt файл или ссылку. Пожалуйста, свяжитесь с администратором.

source: User {} successfully registered.
ru: Пользователь {} успешно зарегистрирован.

source: Registration completed, but a sync error occurred. Please contact admin.
ru: Регистрация завершена, но произошла ошибка синхронизации. Пожалуйста, свяжитесь с администратором.

source: 👤 Client language: {}
ru: 👤 Язык клиента: {}

source: 📱 Via Telegram: {} (ID: {})
ru: 📱 Через Telegram: {} (ID: {})

source: 🔑 Registered by Admin ID: {}
ru: 🔑 Зарегистрировано администратором с ID: {}

source: Registration request:
ru: Запрос на регистрацию:

source: Nickname:
ru: Никнейм:

source: Telegram User:
ru: Пользователь Telegram:

source: Approve registration?
ru: Одобрить регистрацию?

source: No
ru: Нет

source: Registration request sent to administrators. Please wait for approval.
ru: Запрос на регистрацию отправлен администраторам. Пожалуйста, ожидайте одобрения.

source: admin_keyboard_delete_user
ru: Удалить пользователя

source: admin_panel_title
ru: Панель администратора

source: admin_delete_processing
ru: Обработка запроса на удаление...

source: admin_delete_prompt_identifier
ru: Пожалуйста, отправьте Telegram ID или TeamTalk имя пользователя для удаления.

source: admin_delete_success
ru: Пользователь {identifier} успешно удален.

source: admin_delete_fail_db
ru: Не удалось удалить пользователя {identifier} из базы данных.

source: admin_delete_user_not_found
ru: Пользователь {identifier} не найден.

source: admin_delete_invalid_input
ru: Неверный ввод. Пожалуйста, отправьте действительный Telegram ID или TeamTalk имя пользователя.
